

####################################################################################
# 답안은 제공된 R 스크립트에 작성 후, i-class 중간고사 과제함에 제출하시오.
# 문제 번호, OX문제, 또는 설명이 필요한 부분에 대해서는 주석(#)처리하여 작성하시오.
# R 파일의 이름은 ‘final_학번_이름’ 으로 해서 제출하시오.
####################################################################################

# 학생 명예선서(Honor Code)
# "나는 정직하게 시험에 응할 것을 서약합니다."
# 서명: 



# 1. OX 문제 [총 10점, 정답 +2점, 오답 -2점, 공백 0점]
# (a) 산점도를 통해 두 변수 간의 직선의 관계 뿐만 아니라, 곡선의 관계도 알 수 있다. (     )
# (b) 상관계수를 통해 두 변수간의 인과 관계를 알 수 있다. (     )
# (c) X ~ binomial(n,p)를 따르는 확률변수 X에 대하여,
#     n은 충분히 크고, p는 충분히 작으면 포아송 분포로 근사할 수 있다. (     )
# (d) pnorm(x, lower.tail = F)는 표준정규분포를 따르는 확률변수 X에 대하여 P[X <= x]를 계산한다. (     )
# (e) 정규확률그림이 직선에 가까우면 모집단이 정규분포를 따른다고 할 수 있다. (     )



# 3. R basic [총 10점]
# (a) 1 ~ 1000까지의 연속된 정수를 9를 간격으로 변수 num에 저장하시오. (예: 1, 10, …, 991, 1000) [2점]
# (b) num 변수를 내림차순 정렬하여 변수 num2에 저장하시오. [3점]
# (c) num2 변수의 원소 중, 703의 값은 몇 번째 인덱스에 있는지 출력하시오. [5점]

